uses PT4;
var x1, y1:real;            // координаты точки
    x2, y2:real;            // координаты точки
    x3, y3:real;            // координаты точки
    x4, y4:real;            // координаты точки
    r1, r2:real;
{   x2, y2 *
          / \
  x1, y1 *   \
         |\   *--------*
         | \ /         r2
         |  * x3,y3----*
         |  |
         *r1*
}
begin
  Task('if23');           // запуск задачника
  read(x1,y1,x2,y2,x3,y3);              // ввод координат
  r1:=x1-x2;
  r2:=y2-y3;
  x4:=x3+r1;
  y4:=y3-r2;
  write(x4,y4);
end.

